Ran Plan for 2 projects:

1. project: `frontend_amer_autoscale` dir: `frontend/gcp_autoscale` workspace: `amer`
1. project: `frontend_asia_autoscale` dir: `frontend/gcp_autoscale` workspace: `asia`

### 1. project: `frontend_amer_autoscale` dir: `frontend/gcp_autoscale` workspace: `amer`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_autoscaler.asg[0] will be updated in-place
~ resource "google_compute_autoscaler" "asg" {
        creation_timestamp = "2020-09-20T18:44:39.498-07:00"
        id                 = "projects/2036174436/zones/us-central1-c/autoscalers/asg-amer-us-central1"
        name               = "asg-amer-us-central1"
        project            = "2036174436"
        self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-central1-c/autoscalers/asg-amer-us-central1"
      ~ target             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-central1-c/instanceGroupManagers/asg-group-manager-amer-us-central1" -> "projects/2036174436/zones/us-central1-c/instanceGroupManagers/asg-group-manager-amer-us-central1"
        zone               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-central1-c"

        autoscaling_policy {
            cooldown_period = 60
            max_replicas    = 1
            min_replicas    = 1
            mode            = "ON"

            cpu_utilization {
                target = 0.5
            }
        }
    }

  # google_compute_instance_group_manager.asg[0] will be updated in-place
~ resource "google_compute_instance_group_manager" "asg" {
        base_instance_name = "frontend-asg-amer-us-central10"
        fingerprint        = "ISJ3snQj0FU="
        id                 = "projects/2036174436/zones/us-central1-c/instanceGroupManagers/asg-group-manager-amer-us-central1"
        instance_group     = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-central1-c/instanceGroups/asg-group-manager-amer-us-central1"
        name               = "asg-group-manager-amer-us-central1"
        project            = "2036174436"
        self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-central1-c/instanceGroupManagers/asg-group-manager-amer-us-central1"
        target_pools       = [
            "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-central1/targetPools/asg-target-pool-us-central1",
        ]
        target_size        = 1
        wait_for_instances = false
        zone               = "us-central1-c"

        update_policy {
            max_surge_fixed         = 1
            max_surge_percent       = 0
            max_unavailable_fixed   = 1
            max_unavailable_percent = 0
            min_ready_sec           = 0
            minimal_action          = "REPLACE"
            type                    = "OPPORTUNISTIC"
        }

      ~ version {
          ~ instance_template = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/instanceTemplates/terraform-20200921002726942000000001" -> (known after apply)
        }
    }

  # google_compute_instance_template.asg must be replaced
-/+ resource "google_compute_instance_template" "asg" {
        can_ip_forward          = false
      ~ id                      = "projects/2036174436/global/instanceTemplates/terraform-20200921002726942000000001" -> (known after apply)
        machine_type            = "f1-micro"
        metadata                = {
            "ssh-keys" = <<~EOT
                dmalicia:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCobuzwfxuNnlZUgmPqHdSLj6+s6giPOfCCfi2UjHpuzMr5/cRS0HxZBem2A0cyNcbPiG+WIsnd+jocrqE+WlaioLZwXWPbQ4OAYeZb0yibfks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        }
      ~ metadata_fingerprint    = "pTtY6EQNmzs=" -> (known after apply)
      ~ metadata_startup_script = <<~EOT # forces replacement
          - sudo apt-get update
          + sudo apt-get update;
            rm -rf /etc/motd
          - sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip
          + sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip;
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -;
          - A=`lsb_release -cs`
          + A=`lsb_release -cs`;
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
          + sleep 3
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
          - sleep 10
          + sleep 10;
          + echo "sleep 10" >> /tmp/meio;
            git clone https://github.com/dmalicia/dm-terraform.git /usr/local/share/dm-terraform/
            wget https://apt.puppetlabs.com/puppetlabs-release-trusty.deb /
            sleep 10
            sudo dpkg -i /puppetlabs-release-trusty.deb
          + echo "instalou?" >> /tmp/meio;
            sudo apt-get update
            sudo apt-get install puppet -yq
            cat >> /etc/default/puppet <<EOF
            START=yes
            EOF
            cat >> /puppet.conf <<EOF
            [agent]
            server = seed.dmlc.pw
            EOF
            cp /puppet.conf /etc/puppet/puppet.conf
          + sudo service stop puppet
            echo "*/5 * * * * root puppet agent -t" >> /etc/crontab
        EOT
      ~ name                    = "terraform-20200921002726942000000001" -> (known after apply)
      + name_prefix             = (known after apply)
      ~ project                 = "2036174436" -> (known after apply)
      + region                  = (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/beta/projects/heroic-muse-289316/global/instanceTemplates/terraform-20200921002726942000000001" -> (known after apply)
      - tags                    = [] -> null
      + tags_fingerprint        = (known after apply)

      ~ disk {
            auto_delete  = true
          ~ boot         = true -> (known after apply)
          ~ device_name  = "persistent-disk-0" -> (known after apply)
          - disk_size_gb = 0 -> null
          ~ disk_type    = "pd-standard" -> (known after apply)
          ~ interface    = "SCSI" -> (known after apply)
          - labels       = {} -> null
          ~ mode         = "READ_WRITE" -> (known after apply)
          ~ source_image = "projects/debian-cloud/global/images/family/debian-9" -> "debian-cloud/debian-9"
          ~ type         = "PERSISTENT" -> (known after apply)
        }

      ~ network_interface {
          + name               = (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/networks/default" -> "default"
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_amer_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Famer)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_amer_autoscale`
</details>

---
### 2. project: `frontend_asia_autoscale` dir: `frontend/gcp_autoscale` workspace: `asia`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_autoscaler.asg[0] will be created
+ resource "google_compute_autoscaler" "asg" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "asg-asia-australia-southeast1"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target             = "projects/2036174436/zones/australia-southeast1-b/instanceGroupManagers/asg-group-manager-asia-australia-southeast1"
      + zone               = "australia-southeast1-b"

      + autoscaling_policy {
          + cooldown_period = 60
          + max_replicas    = 1
          + min_replicas    = 1
          + mode            = "ON"

          + cpu_utilization {
              + target = 0.5
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_asia_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Fasia)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_asia_autoscale`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
